# Дан список чисел. Создайте список, в который попадают числа, описываемые возрастающую последовательность.
# Порядок элементов менять нельзя.
# *Пример:*
# [1, 5, 2, 3, 4, 6, 1, 7] => [1, 2, 3] или [1, 7] или [1, 6, 7] и т.д

a = [1, 5, 2, 3, 4, 6, 1, 7]
b = []
while len(a) != 1:
    c = [a[0]]
    k = 0
    for i in range(1,len(a)):
        if c[k]<a[i]:
            c.append(a[i])
            k+=1
    a.remove(a[0])
    if len(c)>1:
        b.append(c)
for i in range (len(b)):
    print(b[i])
