# Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.

# *Пример:*

# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

k = 0
str_list = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
str_found = "qwe"
for i in range(len(str_list)):
    if str_list[i] == str_found:
        k += 1
        if k == 2:
            print(i)
            break
    if i == len(str_list)-1:
        print(-1)
